## Plan Result (sbox_apim_appgw)




<pre><code>Plan: 0 to add, 4 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_public_ip.app_gw[0]
  * module.app-gw.azurerm_user_assigned_identity.identity




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-sandbox-agw"
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-sandbox-agw"
        name                              = "sdshmcts-apim00-sandbox-agw"
      ~ tags                              = {
            "application"  = "core"
          ~ "builtFrom"    = "hmcts/hub-terraform-infra" -> "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

        # (16 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                             = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/applicationGateways/sdshmcts-apim00-sandbox-agw|AppGw"
        name                           = "AppGw"
        # (5 unchanged attributes hidden)

      ~ metric {
          + eventhub_authorization_rule_id = (known after apply)
          + eventhub_name                  = (known after apply)
          + id                             = (known after apply)
          + log_analytics_destination_type = (known after apply)
          + log_analytics_workspace_id     = (known after apply)
          + name                           = (known after apply)
          + partner_solution_id            = (known after apply)
          + storage_account_id             = (known after apply)
          + target_resource_id             = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_public_ip.app_gw[0] will be updated in-place
  ~ resource "azurerm_public_ip" "app_gw" {
        id                      = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/publicIPAddresses/sdshmcts-apim-appgw-sandbox-pip"
        name                    = "sdshmcts-apim-appgw-sandbox-pip"
      ~ tags                    = {
            "application"  = "core"
          ~ "builtFrom"    = "hmcts/hub-terraform-infra" -> "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)
    }

  # module.app-gw.azurerm_user_assigned_identity.identity will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "identity" {
        id                  = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sdshmcts-apim-sandbox-agw"
        name                = "sdshmcts-apim-sandbox-agw"
      ~ tags                = {
            "application"  = "core"
          ~ "builtFrom"    = "hmcts/hub-terraform-infra" -> "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":807,"Program":"tfcmt","SHA1":"","Target":"sbox_apim_appgw","Vars":{}} -->